docs/index.org
#+TITLE: OO Software Specification and Construction @@html:<br>@@ (SWE 619 Course Syllabus -  Fall 2021)
#+OPTIONS: ^:nil toc:nil 
#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
#+HTML_HEAD: <link rel="alternative stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
  
#+begin_center
#+begin_export html
    <address>
    Instructor: 	<a href="https://nguyenthanhvuh.github.io">ThanhVu Nguyen</a><br>
    Office: 	Zoom<br>
    Course Location: 	Zoom <br>
    Email: 	<a href="mailto:tnguy212@gmu.edu">nguy212@gmu.edu</a><br>
    URL: 	<a href="https://nguyenthanhvuh.github.io/class-oo">https://nguyenthanhvuh.github.io/class-oo</a><br>
    Class Hours: 	Mondays 4:30 to 7:10, Online (BB)<br>
    Office Hour Zoom: 	TBA (Zoom) <br>
    </address>
#+end_export
#+end_center

* [[./schedule.html][SCHEDULE and ASSIGNMENTS]]
   
* Course Description

  To give the students a solid understanding of modern software construction. To prepare students to construct sequential and concurrent programs. To encourage the construction of software systems of high quality. In-depth study of software construction in a modern language including control structuring and packaging. Concepts such as information hiding, data abstraction, and object-based and object-oriented software construction are discussed and illustrated. This course is part of the core of the SWE program. This section of 619 uses Java.

  *Prerequisite*: SWE Foundation Courses or equivalent

* Course Materials

  * Joshua Bloch. [[https://www.amazon.com/Effective-Java-Joshua-Bloch/dp/0134685997/ref=sr_1_1?dchild=1&keywords=effective+java&qid=1626231154&sr=8-1][/Effective Java/]]. Third Edition. Addison-Wesley Professional, 2017, ISBN 978-0-13-468599-1. *Required*. 
    + [[http://proquest.safaribooksonline.com/book/programming/java/9780134686097][Direct Safari Link]]
    + [[https://learning-oreilly-com.mutex.gmu.edu/library/view/effective-java-3rd/9780134686097/cover.xhtml][Mason Safari Link (off campus)]], [[https://www.oreilly.com/library/view/program-development-in/9780768685299/?ar][General Safari link]]
  - Barbara Liskov with John Guttag. [[https://www.amazon.com/Program-Development-Java-Specification-Object-Oriented/dp/0201657686/ref=sr_1_2?dchild=1&qid=1626231221&refinements=p_27%3ABarbara+Liskov&s=books&sr=1-2&text=Barbara+Liskov][/Program Development in Java: Abstraction, Specification, and Object-Oriented Design/]]. Addison Wesley, 2001, ISBN 0-201-65768-6. *Required*. 
    + [[http://proquest.safaribooksonline.com/book/programming/java/9780768685299][Direct Safari Link]]
    + [[https://learning-oreilly-com.mutex.gmu.edu/library/view/program-development-in/9780768685299/ch1.html][General Safari Link (off campus)]]
      # - Note that you can access the Java 8 APIs at the Oracle site.

  *Note on the course materials*: We'll start with Liskov. Don't worry about the publication date; Liskov is basically a math book, and hence ages remarkably well. We're interested in contracts, mutability, data abstraction, and type abstraction. Bloch is concerned about the same things, but explores them in more detail and in more up-to-date Java. Bloch also corrects some important points that weren't well understood when Liskov's text came out.

* Weekly schedule

  This class is a group-based, hybrid synchronous, online offering. That means you need to be present in class at class time. You will also need to schedule regular meetings with your group and with me (and possibly the GTA) outside of class.
  # This is my second offering of this class in a full-time online format. Mostly, we'll do what I did last fall, but there are some updates and tweaks.

  Each week will cover a small number of related technical issues (see course [[./schedule.html][schedule]]). Let's call this small number of technical issues a "topic". Each topic will follow roughly the same sequence of preparation, in-class learning activities, homework completion and (possibly) presentation, and knowledge assessment. To make this scale in an online environment, many of these activities will be group based. The sequence is:

  - Preparation: Complete assigned readings and watch relevant videos, if any.
  - Reading Reflection: This is a formal opportunity for each group to reflect on the reading.
  - Synchronous Class Meeting (BB Collaborate):
    + Prior week's homework solution presentation and discussion. This is typically a randomly selected group, but occasionally, I'll do the presentation.
    + Reading reflection summary
    + Combined session on the day's topic, followed by in-class exercises (group breakouts)
    + Break
    + Combined session on the day's topic, followed by in-class exercises (group breakouts)
    + Wrap up
  - Homework (group-based).
  - Individual oral assessments.

* Grading

  | Assignenmts                        | Percentage |
  |------------------------------------+------------|
  | Group Functioning (group-based)    |        10% |
  | Reading Reflections (group-based)  |        10% |
  | Homework assignments (group-based) |        15% |
  | Oral Assessments (individual)      |        35% |
  | Final exam (individual)            |        30% |

** Group Functioning

   Every student needs to be part of a group. I would prefer that groups stay stable throughout the semester, but if there is a good rationale to reconfigure a group or two, we'll do that.

   *Group size*: 2 to 4 students.

   Group creation mechanism: As a default, we'll drop students into groups at random. If you are happy with your random group, great! If you prefer a different group, during the first week you will have the option to re-group. If your group dwindles to just yourself, you'll need to join another group.

   At the end of the semester, each individual will provide an assessment of the rest of their group. This assessment will determine the "Group Functioning" part of the grade.

   Groups can communicate internally through any mechanism they choose: zoom, discord, google docs, etc

** Reading Reflections

   Each week, each group must complete a "reading reflection" the day *before* class. (That means midnight Sunday, in the case of this class, since class meetings are Monday afternoon.) I will review these assessments before class, compile the overall responses, and use them to tune the in-class activities. Reading reflections are available on Blackboard. These reflections are part of the learning process rather than the assessment process. That is, they don't assess whether you have achieved mastery of the new material, rather they check whether you have done the necessary preparation.

   *Important*
   * There are no make-ups.
   * Only one submission per *group*. Everyone in the group gets the same credit.

