docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-21 Wed 00:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>OO Software Specification and Construction <br> (SWE 619 Course Syllabus -  Fall 2021)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="alternative stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">OO Software Specification and Construction <br> (SWE 619 Course Syllabus -  Fall 2021)</h1>
<div class="org-center">
<address>
Instructor: 	<a href="https://nguyenthanhvuh.github.io">ThanhVu Nguyen</a><br>
Office: 	Zoom<br>
Course Location: 	Zoom <br>
Email: 	<a href="mailto:tnguy212@gmu.edu">tnguy212@gmu.edu</a><br>
URL: 	<a href="https://nguyenthanhvuh.github.io/class-oo">https://nguyenthanhvuh.github.io/class-oo</a><br>
Class Hours: 	Mondays 4:30 to 7:10, Online (BB)<br>
Office Hour Zoom: 	TBA (Zoom) <br>
</address>
</div>

<div id="outline-container-org18436b5" class="outline-2">
<h2 id="org18436b5"><span class="section-number-2">1</span> <a href="./schedule.html">SCHEDULE and ASSIGNMENTS</a></h2>
</div>

<div id="outline-container-org8fb7053" class="outline-2">
<h2 id="org8fb7053"><span class="section-number-2">2</span> Course Description</h2>
<div class="outline-text-2" id="text-2">
<p>
To give the students a solid understanding of modern software construction. To prepare students to construct sequential and concurrent programs. To encourage the construction of software systems of high quality. In-depth study of software construction in a modern language including control structuring and packaging. Concepts such as information hiding, data abstraction, and object-based and object-oriented software construction are discussed and illustrated. This course is part of the core of the SWE program. This section of 619 uses Java.
</p>

<p>
<b>Prerequisite</b>: SWE Foundation Courses or equivalent
</p>
</div>
</div>

<div id="outline-container-orgf1ee84f" class="outline-2">
<h2 id="orgf1ee84f"><span class="section-number-2">3</span> Course Materials</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Joshua Bloch. <a href="https://www.amazon.com/Effective-Java-Joshua-Bloch/dp/0134685997/ref=sr_1_1?dchild=1&amp;keywords=effective+java&amp;qid=1626231154&amp;sr=8-1"><i>Effective Java</i></a>. Third Edition. Addison-Wesley Professional, 2017, ISBN 978-0-13-468599-1. <b>Required</b>. 
<ul class="org-ul">
<li><a href="http://proquest.safaribooksonline.com/book/programming/java/9780134686097">Direct Safari Link</a></li>
<li><a href="https://learning-oreilly-com.mutex.gmu.edu/library/view/effective-java-3rd/9780134686097/cover.xhtml">Mason Safari Link (off campus)</a>, <a href="https://www.oreilly.com/library/view/program-development-in/9780768685299/?ar">General Safari link</a></li>
</ul></li>
<li>Barbara Liskov with John Guttag. <a href="https://www.amazon.com/Program-Development-Java-Specification-Object-Oriented/dp/0201657686/ref=sr_1_2?dchild=1&amp;qid=1626231221&amp;refinements=p_27%3ABarbara+Liskov&amp;s=books&amp;sr=1-2&amp;text=Barbara+Liskov"><i>Program Development in Java: Abstraction, Specification, and Object-Oriented Design</i></a>. Addison Wesley, 2001, ISBN 0-201-65768-6. <b>Required</b>. 
<ul class="org-ul">
<li><a href="http://proquest.safaribooksonline.com/book/programming/java/9780768685299">Direct Safari Link</a></li>
<li><a href="https://learning-oreilly-com.mutex.gmu.edu/library/view/program-development-in/9780768685299/ch1.html">General Safari Link (off campus)</a></li>
</ul></li>
</ul>

<p>
<b>Note on the course materials</b>: We'll start with Liskov. Don't worry about the publication date; Liskov is basically a math book, and hence ages remarkably well. We're interested in contracts, mutability, data abstraction, and type abstraction. Bloch is concerned about the same things, but explores them in more detail and in more up-to-date Java. Bloch also corrects some important points that weren't well understood when Liskov's text came out.
</p>
</div>
</div>

<div id="outline-container-org63da0c9" class="outline-2">
<h2 id="org63da0c9"><span class="section-number-2">4</span> Weekly schedule</h2>
<div class="outline-text-2" id="text-4">
<p>
This class is a group-based, hybrid synchronous, online offering. That means you need to be present in class at class time. You will also need to schedule regular meetings with your group and with me (and possibly the GTA) outside of class.
</p>

<p>
Each week will cover a small number of related technical issues (see course <a href="./schedule.html">schedule</a>). Let's call this small number of technical issues a "topic". Each topic will follow roughly the same sequence of preparation, in-class learning activities, homework completion and (possibly) presentation, and knowledge assessment. To make this scale in an online environment, many of these activities will be group based. The sequence is:
</p>

<ul class="org-ul">
<li>Preparation: Complete assigned readings and watch relevant videos, if any.</li>
<li>Reading Reflection: This is a formal opportunity for each group to reflect on the reading.</li>
<li>Synchronous Class Meeting (BB Collaborate):
<ul class="org-ul">
<li>Prior week's homework solution presentation and discussion. This is typically a randomly selected group, but occasionally, I'll do the presentation.</li>
<li>Reading reflection summary</li>
<li>Combined session on the day's topic, followed by in-class exercises (group breakouts)</li>
<li>Break</li>
<li>Combined session on the day's topic, followed by in-class exercises (group breakouts)</li>
<li>Wrap up</li>
</ul></li>
<li>Homework (group-based).</li>
<li>Individual oral assessments.</li>
</ul>
</div>
</div>

<div id="outline-container-orga50cd54" class="outline-2">
<h2 id="orga50cd54"><span class="section-number-2">5</span> Grading</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Assignenmts</th>
<th scope="col" class="org-right">Percentage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Group Functioning (group-based)</td>
<td class="org-right">10%</td>
</tr>

<tr>
<td class="org-left">Reading Reflections (group-based)</td>
<td class="org-right">10%</td>
</tr>

<tr>
<td class="org-left">Homework assignments (group-based)</td>
<td class="org-right">15%</td>
</tr>

<tr>
<td class="org-left">Oral Assessments (individual)</td>
<td class="org-right">35%</td>
</tr>

<tr>
<td class="org-left">Final exam (individual)</td>
<td class="org-right">30%</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org2bd0f8b" class="outline-3">
<h3 id="org2bd0f8b"><span class="section-number-3">5.1</span> Group Functioning</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Every student needs to be part of a group. I would prefer that groups stay stable throughout the semester, but if there is a good rationale to reconfigure a group or two, we'll do that.
</p>

<p>
<b>Group size</b>: 2 to 4 students.
</p>

<p>
Group creation mechanism: As a default, we'll drop students into groups at random. If you are happy with your random group, great! If you prefer a different group, during the first week you will have the option to re-group. If your group dwindles to just yourself, you'll need to join another group.
</p>

<p>
At the end of the semester, each individual will provide an assessment of the rest of their group. This assessment will determine the "Group Functioning" part of the grade.
</p>

<p>
Groups can communicate internally through any mechanism they choose: zoom, discord, google docs, etc
</p>
</div>
</div>

<div id="outline-container-orge4c0062" class="outline-3">
<h3 id="orge4c0062"><span class="section-number-3">5.2</span> Reading Reflections</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Each week, each group must complete a "reading reflection" the day <b>before</b> class. (That means midnight Sunday, in the case of this class, since class meetings are Monday afternoon.) I will review these assessments before class, compile the overall responses, and use them to tune the in-class activities. Reading reflections are available on Blackboard. These reflections are part of the learning process rather than the assessment process. That is, they don't assess whether you have achieved mastery of the new material, rather they check whether you have done the necessary preparation.
</p>

<p>
<b>Important</b>
</p>
<ul class="org-ul">
<li>There are no make-ups.</li>
<li>Only one submission per <b>group</b>. Everyone in the group gets the same credit.</li>
</ul>
</div>
</div>
