docs/index.org
** Homework Assignments

   There are weekly *group* homework assighments. I post homework assignments on the class [[./schedule.html][schedule web site]]. Generally, your group should submit assignments via Blackboard.

   Because of the way in which this class is taught, it is important to stay on pace. Homeworks are due *before class*. Late submissions are not accepted except in truly exceptional circumstances.

   *Important*: 
   * Each group should be prepared to present their homework solution in class.
   * *Statement of who did what*. Homeworks are group exercises. Each submission must contain a specific statement of who did what.
   * *Solutions and solution checking*. The group must split their roles on each exercise. Part of the group creates the solution. A separate part of the group checks the solution, certifies that it is correct, and *explains why it is correct*. If you can't formulate this explanation, it's time for your group to see me or the GTA in office hours.
     + Note: this model is common in engineering, where engineers sometimes create solutions and other times certify solutions. You should rotate roles within your group from week to week.

** Oral Assessments

   Ideally, oral assessments should happen every week. But I don't have the bandwidth to make that happen. Instead, every student will schedule an oral assessment once every *two* weeks.

   *Process*:
   * Scheduling: While each student will complete each assessment individually, we will schedule assessments by group. Students in odd numbered gropus should schedule themselves for an assessment in weeks with odd-numbered oral assessment guides. Students in even numbered groups should schedule themselves for an assessment in weeks with even-numbered oral assessment guides.
   * Duration: Each assessment lasts 10 minutes. This is a little tight, but generally works.
   * I will be forthcoming and concrete about the content for each assessment. I'll do this in the form of "Oral Assessment Guides" posted to the course schedule. That is, you shouldn't be surprised by any of the questions. Often, they will be closely related to the prior week's homework. The questions will typically look like, "What would Liskov (or Bloch) think of the following variation(s) of this snippet of code we studied last week? And why would they think that?"
   * Not every student will get the same quiz, even if the quiz is on the same day.
   * The evaluation scale is as follows:
     + Awesome means you demonstrate mastery of the material. Scores 10/10.
     + Strong performance, but perhaps a slight wobble: Scores 9/10.
     + Acceptable, but some significant errors: Scores 8/10.
     + Weak: Scores 5/10 to 7/10.
     + Unacceptable: Scores 0/10.
     Make-ups. The goal is to get you to understand the material. So, if you score as "Weak" or "Unacceptable", I'll give you an opportunity for a make-up. The maximum score on a make-up is 8/10. Before I'll admit you for a make-up, you will have to practice with the GTA. If the GTA gives me the green light, I'll schedule a make-up.

** Final Exam

   There will be a final exam appropriate for the online, unproctored nature of this class offering. I plan to offer an oral option as well as a written option. The last class of the semester will include a detailed discussion of the exam structure and contents.

   -----

* Class Attendance

  I place great emphasis on peer learning and interactive engagement. The class is structured to leverage group interactions to the largest extent possible for the purpose of maximizing learning gain through out the semester.

  Bottome line: It's important to be in class.

* In-Class Exercises

  I plan an in-class exercise for every class. Students will work in their designated group. Some of these exercises need a Java development environment. Very often, the in-class exercises will be closely related to an upcoming homework assignment.

* ShowMe Videos/Other videos

  The course schedule page links to a number of short videos created by [[https://cs.gmu.edu/~pammann/][Paul Ammann]] with the ShowMe service. Some students find these helpful for grasping key points from various lectures.
  # Several items of note:
  # - Each ShowMe captures an interaction a student has with me. Such interactions can help students master the material more effectively than having me drone on solo.
  # - I am interested in creating more ShowMe videos for other topics in the course. Contact me if you would like to help me do this.
  # - I am open to redoing existing topics if there is something you think could be done better.
  # - Other videos are just me.

* Record Keeping

  We'll use Blackboard to maintain *RAW* scores and attendance data. Grades are computed according to this syllabus. There is a column in BB labeled "TOTAL": Ignore it; it's meaningless for this class. (BB, in typical BB arrogance, does not give me the option of disabling or hiding this column.)

  It's the student's responsibility to ensure that Blackboard records are correct. (I'm happy to correct errors.)

  Every semester, I get email from students wondering why there grade doesn't correspond to the TOTAL column in BB. Please don't be the student who sends me this message.

* Email

  Please note that questions of general interest should not be emailed to me. Post on Piazza instead.

* Virginia Privacy Laws

  The state of Virginia now has laws that require the University (including me) not to disclose student email addresses, phone numbers, and addresses. This will impact communications in this class as follows:
  - Communicating via email with groups of students is problematic. (Bcc is a partial but not very good, solution.) As far as I have been able to determine, Piazza does not make student emails visible to other students, even though instructors can see email addresses. Hence, this is another reason to favor the Piazza forum.
  - *You* can choose to disclose your email whenever and wherever you wish. That's up to you.

* Piazza

  I find anonymous discussions unhelpful in this class; here learning is predicated on interactions. Plus, part of your education is to learn to stand behind your questions and ideas. That's how employees function in the working world. Piazza allows partial, but not complete, control of anonymous posts. Should someone post anonymously, I will ask the poster to change the visibility and ask the class not to respond to the anonymous version.


  -----

* Honor Code

  As with all GMU courses, SWE 619 is governed by the [[http://oai.gmu.edu/the-mason-honor-code/][GMU Honor Code]]. In this course, all oral assessments and the final exam carry with them an implicit statement that it is the sole work of the author. Further, all group submissions require a statement of participation from each member of the group.

