docs/index.html

<div id="outline-container-org17995a7" class="outline-3">
<h3 id="org17995a7"><span class="section-number-3">5.3</span> Homework Assignments</h3>
<div class="outline-text-3" id="text-5-3">
<p>
There are weekly <b>group</b> homework assighments. I post homework assignments on the class <a href="./schedule.html">schedule web site</a>. Generally, your group should submit assignments via Blackboard.
</p>

<p>
Because of the way in which this class is taught, it is important to stay on pace. Homeworks are due <b>before class</b>. Late submissions are not accepted except in truly exceptional circumstances.
</p>

<p>
<b>Important</b>: 
</p>
<ul class="org-ul">
<li>Each group should be prepared to present their homework solution in class.</li>
<li><b>Statement of who did what</b>. Homeworks are group exercises. Each submission must contain a specific statement of who did what.</li>
<li><b>Solutions and solution checking</b>. The group must split their roles on each exercise. Part of the group creates the solution. A separate part of the group checks the solution, certifies that it is correct, and <b>explains why it is correct</b>. If you can't formulate this explanation, it's time for your group to see me or the GTA in office hours.
<ul class="org-ul">
<li>Note: this model is common in engineering, where engineers sometimes create solutions and other times certify solutions. You should rotate roles within your group from week to week.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb4fccc8" class="outline-3">
<h3 id="orgb4fccc8"><span class="section-number-3">5.4</span> Oral Assessments</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Ideally, oral assessments should happen every week. But I don't have the bandwidth to make that happen. Instead, every student will schedule an oral assessment once every <b>two</b> weeks.
</p>

<p>
<b>Process</b>:
</p>
<ul class="org-ul">
<li>Scheduling: While each student will complete each assessment individually, we will schedule assessments by group. Students in odd numbered gropus should schedule themselves for an assessment in weeks with odd-numbered oral assessment guides. Students in even numbered groups should schedule themselves for an assessment in weeks with even-numbered oral assessment guides.</li>
<li>Duration: Each assessment lasts 10 minutes. This is a little tight, but generally works.</li>
<li>I will be forthcoming and concrete about the content for each assessment. I'll do this in the form of "Oral Assessment Guides" posted to the course schedule. That is, you shouldn't be surprised by any of the questions. Often, they will be closely related to the prior week's homework. The questions will typically look like, "What would Liskov (or Bloch) think of the following variation(s) of this snippet of code we studied last week? And why would they think that?"</li>
<li>Not every student will get the same quiz, even if the quiz is on the same day.</li>
<li><p>
The evaluation scale is as follows:
</p>
<ul class="org-ul">
<li>Awesome means you demonstrate mastery of the material. Scores 10/10.</li>
<li>Strong performance, but perhaps a slight wobble: Scores 9/10.</li>
<li>Acceptable, but some significant errors: Scores 8/10.</li>
<li>Weak: Scores 5/10 to 7/10.</li>
<li>Unacceptable: Scores 0/10.</li>
</ul>
<p>
Make-ups. The goal is to get you to understand the material. So, if you score as "Weak" or "Unacceptable", I'll give you an opportunity for a make-up. The maximum score on a make-up is 8/10. Before I'll admit you for a make-up, you will have to practice with the GTA. If the GTA gives me the green light, I'll schedule a make-up.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org1d48e04" class="outline-3">
<h3 id="org1d48e04"><span class="section-number-3">5.5</span> Final Exam</h3>
<div class="outline-text-3" id="text-5-5">
<p>
There will be a final exam appropriate for the online, unproctored nature of this class offering. I plan to offer an oral option as well as a written option. The last class of the semester will include a detailed discussion of the exam structure and contents.
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-orgbe3e7f2" class="outline-2">
<h2 id="orgbe3e7f2"><span class="section-number-2">6</span> Class Attendance</h2>
<div class="outline-text-2" id="text-6">
<p>
I place great emphasis on peer learning and interactive engagement. The class is structured to leverage group interactions to the largest extent possible for the purpose of maximizing learning gain through out the semester.
</p>

<p>
Bottome line: It's important to be in class.
</p>
</div>
</div>

<div id="outline-container-orgb9391f6" class="outline-2">
<h2 id="orgb9391f6"><span class="section-number-2">7</span> In-Class Exercises</h2>
<div class="outline-text-2" id="text-7">
<p>
I plan an in-class exercise for every class. Students will work in their designated group. Some of these exercises need a Java development environment. Very often, the in-class exercises will be closely related to an upcoming homework assignment.
</p>
</div>
</div>

<div id="outline-container-org45710d8" class="outline-2">
<h2 id="org45710d8"><span class="section-number-2">8</span> ShowMe Videos/Other videos</h2>
<div class="outline-text-2" id="text-8">
<p>
The course schedule page links to a number of short videos created by <a href="https://cs.gmu.edu/~pammann/">Paul Ammann</a> with the ShowMe service. Some students find these helpful for grasping key points from various lectures.
</p>
</div>
</div>

<div id="outline-container-org8d3be5c" class="outline-2">
<h2 id="org8d3be5c"><span class="section-number-2">9</span> Record Keeping</h2>
<div class="outline-text-2" id="text-9">
<p>
We'll use Blackboard to maintain <b>RAW</b> scores and attendance data. Grades are computed according to this syllabus. There is a column in BB labeled "TOTAL": Ignore it; it's meaningless for this class. (BB, in typical BB arrogance, does not give me the option of disabling or hiding this column.)
</p>

<p>
It's the student's responsibility to ensure that Blackboard records are correct. (I'm happy to correct errors.)
</p>

<p>
Every semester, I get email from students wondering why there grade doesn't correspond to the TOTAL column in BB. Please don't be the student who sends me this message.
</p>
</div>
</div>

<div id="outline-container-org8161d9b" class="outline-2">
<h2 id="org8161d9b"><span class="section-number-2">10</span> Email</h2>
<div class="outline-text-2" id="text-10">
<p>
Please note that questions of general interest should not be emailed to me. Post on Piazza instead.
</p>
</div>
</div>

<div id="outline-container-org3d6d2f5" class="outline-2">
<h2 id="org3d6d2f5"><span class="section-number-2">11</span> Virginia Privacy Laws</h2>
<div class="outline-text-2" id="text-11">
<p>
The state of Virginia now has laws that require the University (including me) not to disclose student email addresses, phone numbers, and addresses. This will impact communications in this class as follows:
</p>
<ul class="org-ul">
<li>Communicating via email with groups of students is problematic. (Bcc is a partial but not very good, solution.) As far as I have been able to determine, Piazza does not make student emails visible to other students, even though instructors can see email addresses. Hence, this is another reason to favor the Piazza forum.</li>
<li><b>You</b> can choose to disclose your email whenever and wherever you wish. That's up to you.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8fa9d1" class="outline-2">
<h2 id="orgd8fa9d1"><span class="section-number-2">12</span> Piazza</h2>
<div class="outline-text-2" id="text-12">
<p>
I find anonymous discussions unhelpful in this class; here learning is predicated on interactions. Plus, part of your education is to learn to stand behind your questions and ideas. That's how employees function in the working world. Piazza allows partial, but not complete, control of anonymous posts. Should someone post anonymously, I will ask the poster to change the visibility and ask the class not to respond to the anonymous version.
</p>


<hr />
</div>
</div>

<div id="outline-container-org46b2f5e" class="outline-2">
<h2 id="org46b2f5e"><span class="section-number-2">13</span> Honor Code</h2>
<div class="outline-text-2" id="text-13">
<p>
As with all GMU courses, SWE 619 is governed by the <a href="http://oai.gmu.edu/the-mason-honor-code/">GMU Honor Code</a>. In this course, all oral assessments and the final exam carry with them an implicit statement that it is the sole work of the author. Further, all group submissions require a statement of participation from each member of the group.
</p>
</div>
</div>
