docs/index.org
* Learning Disabilities

  Students with learning disabilities (or other conditions documented with GMU Office of Disability Services) who need academic accommodations should see me and contact the [[http://ods.gmu.edu/][Disability Resource Center]] (DRC) at (703)993-2474. I am more than happy to assist you, but all academic accommodations must be arranged through the DRC.

  -----
* Acknowledgement
  This class is heavily modeled after [[https://cs.gmu.edu/~pammann/][Paul Ammann]]'s [[https://cs.gmu.edu/~pammann/619.html][SWE619 course]].

  
  -----
* Links
  - [[./index.html][Syllabus]]
  - [[./schedule.html][Schedule]]

