docs/index.html

<div id="outline-container-org99b381e" class="outline-2">
<h2 id="org99b381e"><span class="section-number-2">14</span> Learning Disabilities</h2>
<div class="outline-text-2" id="text-14">
<p>
Students with learning disabilities (or other conditions documented with GMU Office of Disability Services) who need academic accommodations should see me and contact the <a href="http://ods.gmu.edu/">Disability Resource Center</a> (DRC) at (703)993-2474. I am more than happy to assist you, but all academic accommodations must be arranged through the DRC.
</p>

<hr />
</div>
</div>
<div id="outline-container-org19f8022" class="outline-2">
<h2 id="org19f8022"><span class="section-number-2">15</span> Acknowledgement</h2>
<div class="outline-text-2" id="text-15">
<p>
This class is heavily modeled after <a href="https://cs.gmu.edu/~pammann/">Paul Ammann</a>'s <a href="https://cs.gmu.edu/~pammann/619.html">SWE619 course</a>.
</p>


<hr />
</div>
</div>
<div id="outline-container-org6d8ec5d" class="outline-2">
<h2 id="org6d8ec5d"><span class="section-number-2">16</span> Links</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
